Revit 2027 API
RebarShapeConstraintAngleFromFixedDir.Direction Property
 A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Direction { get; set; }
Public Property Direction As UV
	Get
	Set
public:
property UV^ Direction {
	UV^ get ();
	void set (UV^ value);
}
member Direction : UV with get, set
Property Value
UV
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: direction has zero length.
See Also
Reference
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace